Revit 2027 API
ParameterTypeId.RoomPlenumLightingParam Property
 "Plenum Lighting Contribution"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoomPlenumLightingParam { get; }
Public Shared ReadOnly Property RoomPlenumLightingParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoomPlenumLightingParam {
	ForgeTypeId^ get ();
}
static member RoomPlenumLightingParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace